package main

import (
	"fmt"
)

func main() {

	orignStr := "尴尬发滚滚滚刚刚高跟控刚看过康复科饭卡更卡飞机放哪放哪放哪你发你发你发你发你发你发你发你发你发你发拒绝才能吃你才能肥牛饭你发你发你发你发你发经发局狙击你发你发你发你超级刺激飞机放哪你发你发你发吧发吧办法吃没吃你猜你猜你猜脑残女那从哪从哪从哪从哪放哪你发你发你发你发才能吃那你放哪肥牛饭你发你发你发你发你发你发你发你发你发你发你发你发你发你发放哪放哪放哪你发就发经济饭卡哥放你那烦你烦你肥牛饭你发你发你发你发你发你那放哪放哪放哪放哪放哪放哪放哪吃vVB宝宝vvvv尴尬发滚滚滚刚刚高跟控刚看过康复科饭卡更卡飞机放哪放哪放哪你发你发你发你发你发你发你发你发你发你发拒绝才能吃你才能肥牛饭你发你发你发你发你发经发局狙击你发你发你发你超级刺激飞机放哪你发你发你发吧发吧办法吃没吃你猜你猜你猜脑残女那从哪从哪从哪从哪放哪你发你发你发你发才能吃那你放哪肥牛饭你发你发你发你发你发你发你发你发你发你发你发你发你发你发放哪放哪放哪你发就发经济饭卡哥放你那烦你烦你肥牛饭你发你发你发你发你发你那放哪放哪放哪放哪放哪放哪放哪 androidPushMsg:吃vVB宝宝vvvv尴尬发滚滚滚刚刚高跟控刚看过康复科饭卡更卡飞机放哪放哪放哪你发你发你发你发你发你发你发你发你发你发拒绝才能吃你才能肥牛饭你发你发你发你发你发经发局狙击你发你发你发你超级刺激飞机放哪你发你发你发吧发吧办法吃没吃你猜你猜你猜脑残女那从哪从哪从哪从哪放哪你发你发你发你发才能吃那你放哪肥牛饭你发你发你发你发你发你发你发你发你发你发你发你发你发你发放哪放哪放哪你发就发经济饭卡哥放你那烦你烦你肥牛饭你发你发你发你发你发你那放哪放哪放哪放哪放哪放哪放哪吃vVB宝宝vvvv尴尬发滚滚滚刚刚高跟控刚看过康复科饭卡更卡飞机放哪放哪放哪你发你发你发你发你发你发你发你发你发你发拒绝才能吃你才能肥牛饭你发你发你发你发你发经发局狙击你发你发你发你超级刺激飞机放哪你发你发你发吧发吧办法吃没吃你猜你猜你猜脑残女那从哪从哪从哪从哪放哪你发你发你发你发才能吃那你放哪肥牛饭你发你发你发你发你发你发你发你发你发你发你发你发你发你发放哪放哪放哪你发就发经济饭卡哥放你那烦你烦你肥牛饭你发你发你发你发你发你那放哪放哪放哪放哪放哪放哪"

	fmt.Println(show_strlen(orignStr))

	orignStr = show_substr(orignStr, 100)
	fmt.Println(orignStr)

	fmt.Println(show_strlen(orignStr))

}

func show_substr(s string, l int) string {
	if len(s) <= l {
		fmt.Printf("do not need deal\n")
		return s
	}
	ss, sl, rl, rs := "", 0, 0, []rune(s)
	for _, r := range rs {
		rint := int(r)
		if rint < 128 {
			rl = 1
		} else {
			rl = 2
		}

		if sl+rl > l {
			break
		}
		sl += rl
		ss += string(r)
	}
	return ss + "..."
}

func show_strlen(s string) int {
	sl := 0
	rs := []rune(s)
	for _, r := range rs {
		rint := int(r)
		if rint < 128 {
			sl++
		} else {
			sl += 2
		}
	}
	return sl
}
